Tekla.Structures.Geometry3d.Point.ToString
Formats the point into a string, using the current culture.
Returns: The string that represents the point.

Tekla.Structures.Geometry3d.Point.ToString(System.Globalization.CultureInfo)
Formats the point into a string, using the provided culture.
Returns: The string that represents the point.